/* 'Cancel' button */
"cancel" = "Cancel";

/* 'Console' tab */
"console" = "Console";

/* 'Create' button */
"create" = "Create";

/* The title of the alert shown for creating a folder */
"creation.createFolder" = "Create folder";

/* The title of the alert shown for creating a script */
"creation.createScript" = "Create script";

/* The message of the alert shown for creating a folder */
"creation.typeFolderName" = "Type the new folder's name";

/* The message of the alert shown for creating a script */
"creation.typeScriptName" = "Type the new script's name";

/* Message shown when the user typed an empty name */
"errors.emptyName" = "Cannot create a file with an empty name.";

/* The title of alerts shown when an error occurred while creating a file */
"errors.errorCreatingFile" = "Error creating file!";

/* The title of alerts shown when an error occurred while creating a folder */
"errors.errorCreatingFolder" = "Error creating folder!";

/* Title of the alert shown when an error occurred while moving a file */
"errors.errorMovingFile" = "Error moving folder!";

/* The title of the alert shown when a script cannot be read */
"errors.errorReadingFile" = "Error reading file!";

/* Title of the alert shown when an error occurred while removing a file */
"errors.errorRemovingFile" = "Error removing file!";

/* Title of the alert shown when an error occurred while renaming a file */
"errors.errorRenamingFIle" = "Error renaming file!";

/* Title of the alert shown when code cannot be written */
"errors.errorWrittingToScript" = "Error saving script!";

/* 'Documentation' button */
"help.documentation" = "Documentation";

/* 'Help' button */
"help.help" = "Help";

/* 'Acknowledgments' button */
"help.licenses" = "Acknowledgments";

/* 'Samples' button */
"help.samples" = "Samples";

/* The message of the alert for selecting a sample */
"help.selectSample" = "Select a sample";

/* 'Source code' button */
"help.sourceCode" = "Source code";

/* The 'Copy' menu item */
"menuItems.copy" = "Copy";

/* The 'Move' menu item */
"menuItems.move" = "Move";

/* The 'Open' menu item */
"menuItems.open" = "Open";

/* The 'Remove' menu item */
"menuItems.remove" = "Remove";

/* The 'Rename' menu item */
"menuItems.rename" = "Rename";

/* The 'Run' menu item */
"menuItems.run" = "Run";

/* Message explaining that an Objective-C exception occurred. Takes 2 arguments: The exception name and the reason */
"objc.exception" = "An Objective-C exception occurred. %@, reason: %@\n\nThis error is not caught by Lua but by the app.\nYou can continue editing scripts but you cannot run scripts anymore until the app is restarted.\n";

/* A message telling the user to press enter to quit Pyto */
"objc.quit" = "Press enter to quit the app.";

/* 'Ok' button */
"ok" = "Ok";

/* View Pisth on the App Store */
"pisth.install" = "View on the App Store";

/* A message for promoting Pisth */
"pisth.message" = "Do you want to run your scripts remotely via SSH? You can download Pisth, an SSH client.";

/* Pisth app name */
"pisth.title" = "Pisth - SSH Client";

/* Message of the alert shown for renaming a file */
"renaming.message" = "Type the new file's name";

/* 'Rename' button */
"renaming.rename" = "Rename";

/* Title of the alert shown for renaming a file */
"renaming.title" = "Rename file";

/* 'REPL' tab */
"repl" = "REPL";
